Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_StopRestart(void)
{
    if (!restartActive)
        return;

    restartActive = false;

    stop_motor();

    motorOwner = MOTOR_OWNER_NONE;
}



typedef struct __attribute__((packed))
{
    uint16_t sig;
    uint8_t  gap;
    uint8_t  retry;
    uint16_t uv;
    uint16_t ov;
    uint8_t  maxrun;
    uint16_t over10;
    uint16_t under10;
    uint8_t  crc;
} SystemEEPROMBlock;

#define EE_ADDR_SYS_BLOCK      0x0000
#define SYS_SIG 0x5A5A
//static uint16_t SYS_CRC16(const uint8_t *d, uint16_t l)
//{
//    uint16_t c = 0xFFFF;
//    while (l--) c = (c>>1) ^ (*d++ + 0xA001);
//    return c;
//}
void ModelHandle_SaveSettingsToEEPROM(void)
{
    SystemEEPROMBlock b;
    b.sig   = SYS_SIG;
    b.gap   = sys.gap_time_s;
    b.retry = sys.retry_count;
    b.uv    = sys.uv_limit;
    b.ov    = sys.ov_limit;
    b.maxrun = sys.maxrun_min;
    b.over10  = (uint16_t)(sys.overload * 10.0f);
    b.under10 = (uint16_t)(sys.underload * 10.0f);

    b.crc = 0;
    uint8_t *p = (uint8_t*)&b;
    for(int i=0;i<sizeof(b)-1;i++) b.crc ^= p[i];

    EEPROM_WriteBuffer(EE_ADDR_SYS_BLOCK, (uint8_t*)&b, sizeof(b));
}
void ModelHandle_LoadSettingsFromEEPROM(void)
{
    SystemEEPROMBlock b;
    EEPROM_ReadBuffer(EE_ADDR_SYS_BLOCK, (uint8_t*)&b, sizeof(b));
    uint8_t crc = 0;
    uint8_t *p = (uint8_t*)&b;
    for(int i=0;i<sizeof(b)-1;i++) crc ^= p[i];
    if(b.sig != SYS_SIG || crc != b.crc) return;
    sys.gap_time_s  = b.gap;
    sys.retry_count = b.retry;
    sys.uv_limit    = b.uv;
    sys.ov_limit    = b.ov;
    sys.maxrun_min  = b.maxrun;
    sys.overload    = b.over10 / 10.0f;
    sys.underload   = b.under10 / 10.0f;
}
void ModelHandle_SaveModeState(void)
{
    modeState.manual_on          = manualActive;
    modeState.semi_on            = semiAutoActive;
    modeState.timer_on           = timerActive;
    modeState.countdown_on       = countdownActive;
    modeState.twist_on           = twistActive;
    modeState.auto_on            = autoActive;
    modeState.motor_on           = (motorStatus == 1);
    modeState.power_restore_mode = powerRestoreMode;

    EEPROM_WriteBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));
}
static void backup_current_mode(void)
{
    previousOwner     = motorOwner;
    previousManual    = manualActive;
    previousSemi      = semiAutoActive;
    previousCountdown = countdownActive;
    previousAuto      = autoActive;
}
static void restore_previous_mode(void)
{
    if (isTankFull())
    {
        stop_motor();
        return;
    }

    manualActive    = previousManual;
    semiAutoActive  = previousSemi;
    countdownActive = previousCountdown;
    autoActive      = previousAuto;

    if (previousManual)
        motorOwner = MOTOR_OWNER_MANUAL;
    else if (previousSemi)
        motorOwner = MOTOR_OWNER_SEMIAUTO;
    else if (previousCountdown)
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    else if (previousAuto)
        motorOwner = MOTOR_OWNER_AUTO;
    else
    {
        /* No previous mode → do NOT auto restart */
        motorOwner = MOTOR_OWNER_NONE;
        suppressAutoOneCycle = true;
        return;
    }

    if (isAnyModeActive())
        start_motor();
}

void ModelHandle_LoadModeState(void)
{
    EEPROM_ReadBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));

    powerRestoreMode = modeState.power_restore_mode;
    if (powerRestoreMode > 2) powerRestoreMode = 0;

    if (powerRestoreMode == 1) /* NO */
    {
        manualActive = semiAutoActive = countdownActive =
        twistActive  = timerActive = autoActive = false;
        return;
    }
    manualActive    = modeState.manual_on;
    semiAutoActive  = modeState.semi_on;
    timerActive     = modeState.timer_on;
    countdownActive = modeState.countdown_on;
    twistActive     = modeState.twist_on;
    autoActive      = modeState.auto_on;
}
void ModelHandle_SaveTimerToEEPROM(void)
{
    TimerEEPROMBlock blk;
    memset(&blk, 0, sizeof(blk));

    blk.signature = TIMER_EE_SIGNATURE;
    blk.version   = TIMER_EE_VERSION;
    memcpy(blk.slots, timerSlots, sizeof(timerSlots));

    blk.crc = Timer_CRC16((uint8_t*)&blk,
                          sizeof(blk) - sizeof(uint16_t));

    EEPROM_WriteBuffer(EE_ADDR_TIMER_BLOCK,
                       (uint8_t*)&blk,
                       sizeof(blk));
}
void ModelHandle_LoadTimerFromEEPROM(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,(uint8_t*)&blk,sizeof(blk));

    if(blk.signature != TIMER_EE_SIGNATURE) return;

    uint16_t crc = Timer_CRC16((uint8_t*)&blk, sizeof(blk)-2);
    if(blk.crc != crc) return;     // <<< CRITICAL

    memcpy(timerSlots, blk.slots, sizeof(timerSlots));
}
void Timer_EEPROM_EnsureValid(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,(uint8_t*)&blk,sizeof(blk));

    uint16_t crc = Timer_CRC16((uint8_t*)&blk,sizeof(blk)-2);

    if(blk.signature!=TIMER_EE_SIGNATURE || blk.crc!=crc)
    {
        memset(timerSlots,0,sizeof(timerSlots));
        ModelHandle_SaveTimerToEEPROM();
    }
}
#define SENSOR_STABLE_TIME_MS   10000UL   // 10 seconds
#define PROBE_THRESHOLD         0.10f
static uint8_t get_tank_level_percent(void)
{
    static uint8_t lastRawLevel = 0;
    static uint8_t stableLevel  = 0;
    static uint32_t levelTimer  = 0;

    uint32_t now = HAL_GetTick();
    uint8_t rawLevel = 0;

    /* -------- RAW LEVEL DETECTION -------- */
    if (adcData.voltages[3] < PROBE_THRESHOLD)
        rawLevel = 100;
    else if (adcData.voltages[2] < PROBE_THRESHOLD)
        rawLevel = 75;
    else if (adcData.voltages[1] < PROBE_THRESHOLD)
        rawLevel = 50;
    else if (adcData.voltages[0] < PROBE_THRESHOLD)
        rawLevel = 25;
    else
        rawLevel = 0;

    /* -------- STABILITY CHECK -------- */
    if (rawLevel != lastRawLevel)
    {
        lastRawLevel = rawLevel;
        levelTimer = now;   // start timing new level
    }

    if ((now - levelTimer) >= SENSOR_STABLE_TIME_MS)
    {
        stableLevel = rawLevel;
    }

    return stableLevel;
}
static bool isTankFull(void)
{
    static uint32_t stableStartTime = 0;
    static bool     stableState     = false;

    uint32_t now = HAL_GetTick();

    bool rawFullDetected =
        (adcData.voltages[3] < PROBE_THRESHOLD);

    if (rawFullDetected)
    {
        if (stableStartTime == 0)
        {
            stableStartTime = now;
        }

        if ((now - stableStartTime) >= SENSOR_STABLE_TIME_MS)
        {
            stableState = true;
        }
    }
    else
    {
        stableStartTime = 0;
        stableState = false;
    }

