Amiya200/stm32_water_tank/Core/Src/model_handle.c
        timerActive = true;
        motorOwner  = MOTOR_OWNER_TIMER;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;
    }

    /* ================= EXIT TIMER MODE ================= */
    if (timerActive && !slotActive)
    {
        motorOwner = MOTOR_OWNER_TIMER;
        stop_motor();

        timerActive = false;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;

        restore_previous_mode();
        ModelHandle_SaveModeState();
        return;
    }

    if (!timerActive)
        return;

    /* ================= HARD STOP CONDITIONS ================= */
    if (isTankFull() ||
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
    {
        stop_motor();
        return;
    }

    /* ================= GAP SELECTION LOGIC ================= */
    uint16_t slotGap = get_active_timer_gap_minutes();
    uint16_t mainGap = sys.gap_time_s / 60;

    uint16_t appliedGapMin = 0;

    if (slotGap > 0)
        appliedGapMin = slotGap;
    else if (mainGap > 0)
        appliedGapMin = mainGap;

    uint32_t gapMs = appliedGapMin * 60UL * 1000UL;

    /* ================= NO GAP MODE (Continuous ON) ================= */
    if (gapMs == 0)
    {
        motorOwner = MOTOR_OWNER_TIMER;
        start_motor();
        return;
    }

    /* ================= GAP MODE ================= */
    switch (timerState)
    {
        case TIMER_STATE_ON:

            if (timerStateDeadline == 0)
            {
                timerStateDeadline = now + gapMs;
                motorOwner = MOTOR_OWNER_TIMER;
                start_motor();
            }

            if (now >= timerStateDeadline)
            {
                stop_motor();
                timerState = TIMER_STATE_OFF;
                timerStateDeadline = now + gapMs;
            }
        break;

        case TIMER_STATE_OFF:

            if (now >= timerStateDeadline)
            {
                timerState = TIMER_STATE_ON;
                timerStateDeadline = 0;
            }
        break;

        default:
            timerState = TIMER_STATE_ON;
            timerStateDeadline = 0;
        break;
    }
}


void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    timerStateDeadline = 0;   // ADD THIS
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;
    motorOwner     = MOTOR_OWNER_SEMIAUTO;

    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
static bool autoStartedByUART = false;
static uint32_t autoStartTime = 0;

void ModelHandle_StartAuto(uint16_t gap_s,
                           uint16_t maxrun_min,
                           uint16_t retry)
{
    if (autoActive) return;
    clear_all_modes();
    autoActive       = true;
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoState        = AUTO_ON_WAIT;
    autoStartTime = HAL_GetTick();       // ✅ store start time
    autoDeadline  = gap_s * 1000UL;      // ✅ store duration only

    request_mode_switch(MOTOR_OWNER_AUTO);
}


void ModelHandle_StopAuto(void)
{
    autoStartedByUART = false;   // <---- IMPORTANT

    stop_motor();
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;

    EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME,
                       (uint8_t[]){0},
                       sizeof(AutoRuntimeBlock));

    ModelHandle_SaveModeState();
}

void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));

    /* ===== VALIDATION ===== */

    if (auto_gap_s == 0xFFFF || auto_gap_s > 3600)
        auto_gap_s = 10;   // default 10 sec

    if (auto_maxrun_min == 0xFFFF || auto_maxrun_min > 600)
        auto_maxrun_min = 30;  // default 30 min

    if (auto_retry_limit == 0xFF || auto_retry_limit > 20)
        auto_retry_limit = 3;  // default 3 retry
}

static void auto_mode_background_control(void)
{
    uint32_t now = HAL_GetTick();
    if (now < bootBlockUntil)
        return;
    if (powerRestoreMode == 2)
        return;
    static bool autoWasStartedByLevel = false;
    uint8_t level = get_tank_level_percent();
    if (manualActive || semiAutoActive ||
        timerActive || countdownActive ||
        twistActive)
    {
        autoWasStartedByLevel = false;
        return;
    }
    if (!autoActive && level <= AUTO_START_LEVEL_PERCENT)
    {
        ModelHandle_StartAuto(auto_gap_s,
                              auto_maxrun_min,
                              auto_retry_limit);
        autoWasStartedByLevel = true;
    }
    if (autoActive &&
        autoWasStartedByLevel &&
        level >= AUTO_STOP_LEVEL_PERCENT)
    {
        ModelHandle_StopAuto();
        autoWasStartedByLevel = false;
    }
}
static uint32_t autoRunStartMs = 0;
uint32_t at = 0;
static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = now_ms();
    at = now;
    uint8_t level = get_tank_level_percent();

    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;
    if (isTankFull() || protectionFault)
    {
        stop_motor();
        autoActive = false;
        autoState  = AUTO_IDLE;
        auto_retry_count = 0;
        Buzzer_TriggerAlert();
        return;
    }
    if (auto_retry_limit > 0 &&
        auto_retry_count >= auto_retry_limit)
    {
        stop_motor();
        autoActive = false;
        autoState  = AUTO_IDLE;
        Buzzer_TriggerAlert();
        return;
    }
    if (timerActive && !timer_any_active_slot())
    {
        stop_motor();
        return;
    }
    switch (autoState)
    {
        case AUTO_IDLE:
        {
            bool levelLow = (level <= AUTO_START_LEVEL_PERCENT);
            if (restartActive ||
               (levelLow && groundWater))
            {
                motorOwner = MOTOR_OWNER_AUTO;
                start_motor();

                autoRunStartMs = now;
                autoDeadline = now + ((uint32_t)auto_gap_s * 1000UL);
                autoState = AUTO_ON_WAIT;
            }
        }
        break;

        case AUTO_ON_WAIT:
        {

            /* AUTO MAX RUN LIMIT */
            if (auto_maxrun_min > 0)
            {
                uint32_t maxRunMs =
                    (uint32_t)auto_maxrun_min * 60000UL;

                if ((now - autoRunStartMs) >= maxRunMs)
                {
                    stop_motor();
                    autoActive = false;
                    autoState = AUTO_IDLE;
                    Buzzer_TriggerAlert();
                    return;
                }
            }

            bool faultCondition =
                (!groundWater || (dryState == DRY_FAULT));
            if ((now - autoStartTime) >= autoDeadline)
            {
                if (faultCondition)
                {
                    stop_motor();
                    auto_retry_count++;

                    autoDeadline =
                        now + ((uint32_t)auto_gap_s * 1000UL);

                    autoState = AUTO_OFF_WAIT;
                }
                else
                {
                    autoDeadline =
                        now + ((uint32_t)auto_gap_s * 1000UL);
                }
            }
        }
        break;
        case AUTO_OFF_WAIT:
        {
            /* Wait strictly for OFF duration to expire */
            if ((int32_t)(now - autoDeadline) < 0)
                break;

